# -*- coding: utf-8 -*-

#该文件保存常用按钮的坐标数据，便于统一维护

debug = True

#拓展包1392，233；645，636
#式神录564，144：503，108~633，181
#挑战

#御魂数字种类对应
# yuhun = ['tu','wang']

#主界面阴阳寮按钮
Btn_YYL = (848,950)
#结界育成
Btn_Jiejie_Yucheng = (961,678)
#育成寄养按钮
Btn_Jiejie_Jiyang = (1777,133)
#启动界面游戏公告
Btn_exit_Gonggao = (1797,71)
#主界面收起栏
main_juanzhou = (1836,973)
#结界
jiejie_point = [
    (496,276),(496,470),(496,680),
    (1040,276),(1040,470),(1040,680),
    (1555,276),(1555,470),(1555,680)
]
#召唤灯笼
Btn_Zhaohuan = (1653,307)
#结界退出按钮
Btn_exit_jiejie = (1808,200)
#每日签到二级按钮
qiandao_p = (960,400)
#花合战按钮
Btn_Huahezhan = (1195,957)
#花合战任务按钮
Btn_Huahezhan_Renwu = (1825,545)
#委派跳过按钮
Btn_Weipai_Skip = (1051,804)
#委派执行中，确认返回按钮
Btn_Weipai_Zhaohui = (1504,660)
#式神录卡片位置
ZB_SSL_Kapian = [
    (320,861),
    (525,861),
    (726,861),
    (928,861),
    (1125,861),
    (1330,861),
    (1530,861)
]

#结界卡寄养
ZB_Jiejie_Jiyang = [
    (713,340),
    (713,490),
    (713,650),
    (713,810)
]

#签到退出按钮（叉子）
qiandao_exit = (1306,161)

#邮件确认领取
youjian_receive_confirm = (1158,858)

#邮箱返回按钮
youjian_back = (1765,170)

#挑战按钮坐标 1752，951：1704，898~1805，994
tiaozhan = (1752,951)

#启动按钮
Btn_Start = (955,896)

#町中 1109，421：1058，394~1153，458
tingzhong = (1109,421)

#探索 1019，209：977，169~1051，253
tansuo = (1019,209)
#召唤
zhaohuan = (1653,320)

#式神录地鬼栏目 1749,702：1640，660~1860，740
SSL_Digui = (1749,702)

#式神录地鬼速刷 1482,249：1461，231~1501，265
SSL_Digui_sushua = (1482,249)

#式神录/泛用 返回按钮 64,43：32，9~95，75
Btn_Back = (64, 43)

#式神录拓展包下载按钮
SSL_TZB_download = (957,728)

#式神录拓展包退出按钮
SSL_TZB_exit = (1393,236)

#式神录拓展包30天不提示
SSL_TZB_30 = (645,638)


#式神录分组点位
SSL_fenzu = [
    (1744,182),
    (1744,281),
    (1744,392),
    (1749,492),
    (1744,595),
    (1744,706),
    (1744,811),
    (1744,914)
]
#式神录预设队伍点位
duiwu_coord = [
    (1480,248),
    (1480,473),
    (1480,701),
    (1480,922)
]

#地鬼筛选按钮
Digui_Shaixuan =(1697,75)

#地鬼挑战按钮
digui1 = (1672,394)
digui2 = (1672,632)
digui3 = (1672,865)

#地鬼BOSS返回按钮
Digui_Back = (1814,67)
#地鬼热门按钮
Digui_Remen = (1814,427)

#御魂界面
yuhun = {
    'tu':   (320, 500),
    'huo':  (860, 500),
    'ri':   (1400, 500),
    'shui': (1840, 500),
    'wang': (320, 500),
    'shi':  (320, 500)
}
#御魂队伍
yuhun_team = {
    'tu':   (3, 1),
    'huo':  (3, 3),
    'ri':   (4, 3),
    'shui': (4, 1),
    'wang': (3, 2),
    'shi':  (3, 4)
}
#御魂层数
yuhun_dashe = {
    'tu':(480, 696),
    'huo':(480, 728),
    'ri':(480, 728),
    'shui':(480, 728),
    'wang':(480, 862),
    'shi':(480, 530)
}
#御魂加成按钮
Btn_jiacheng = (656,83)

#各个加成按钮
jiacheng = [
    (1234,226),
    (1234,331),
    (1234,431),
    (1234,531),
    (1234,631)
]
#加成超时关闭按钮
Btn_Yuhun_Jiacheng_Close = (802,632)

#御魂自选对出按钮（×）
Btn_Yuhun_Zixuan_Exit = (1594,215)

#封魔佛像
fengmo_foxiang = (883,627)
#现世逢魔
fengmo_xianshi = [
    (1834,473),
    (1877,562),
    (1838,654),
    (1866,767)
]
#逢魔中心
fenghmo_cent = (960,520)
#逢魔蓝票购买
fengmo_lanpiao = (959,674)
#逢魔密信退出
fengmo_quit = (1306,98)
#逢魔boss退出按钮
fengmo_boss_quit = (1707,113)
#逢魔日常分类
fengmo_richang = (1670,311)
#封魔二级进入按钮
fengmo_entry = (860,310)
#逢魔式神录
fengmo_SSL = (1215,1005)#点位不对，有无极逢魔时不一样
#封魔4次奖励
fengmo_damo = (1850,350)

#真蛇蛇框确认按钮
snake_confirm = (959,710)

longhun = (1788,947)

#斗技战斗按钮
douji_fight = (1791,916)
#斗技自动上阵
douji_zidong_up = (91,236)
#自动战斗
douji_auto_fight = (91,990)